In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [2]:
# merging data frames
df1 = DataFrame({'key':['X','Z','Y','X','X','Z'], 'data_set_1':np.arange(6)})
df1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   X
4           4   X
5           5   Z

In [3]:
df2 = DataFrame({'key':['Q','A','X'], 'data_set_2':np.arange(3)})
df2

   data_set_2 key
0           0   Q
1           1   A
2           2   X

In [4]:
# merge the data set, many to one method
# overlap where the keys match
pd.merge(df1,df2)

   data_set_1 key  data_set_2
0           0   X           2
1           3   X           2
2           4   X           2

In [5]:
# merge on key
pd.merge(df1, df2, on='key')

   data_set_1 key  data_set_2
0           0   X           2
1           3   X           2
2           4   X           2

In [6]:
# pass using the left data set
pd.merge(df1,df2,on='key', how='left')

   data_set_1 key  data_set_2
0           0   X           2
1           1   Z         NaN
2           2   Y         NaN
3           3   X           2
4           4   X           2
5           5   Z         NaN

In [7]:
pd.merge(df1,df2,on='key', how='right')

   data_set_1 key  data_set_2
0           0   X           2
1           3   X           2
2           4   X           2
3         NaN   Q           0
4         NaN   A           1

In [8]:
pd.merge(df1,df2,on='key',how='outer')

   data_set_1 key  data_set_2
0           0   X           2
1           3   X           2
2           4   X           2
3           1   Z         NaN
4           5   Z         NaN
5           2   Y         NaN
6         NaN   Q           0
7         NaN   A           1

In [10]:
# many to many merge
df3 = DataFrame({'key':['Z','X','Z','Y','X','Y'], 'data_set_3':range(6)})

In [11]:
df4 = DataFrame({'key':['Z','Y','X','Y'], 'data_set_4':range(4)})

In [13]:
pd.merge(df3,df4)

   data_set_3 key  data_set_4
0           0   Z           0
1           2   Z           0
2           1   X           2
3           4   X           2
4           3   Y           1
5           3   Y           3
6           5   Y           1
7           5   Y           3

In [14]:
df_left = DataFrame({'key1':['SF','SF','LA'],
                    'key2':['one','two','one'],
                    'left_data':[10,20,30]})

In [15]:
df_right = DataFrame({'key1':['SF','SF','SF','LA'],
                    'key2':['one','one','one','two'],
                    'right_data':[40,50,60,70]})

In [16]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [17]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   SF  one          60
3   LA  two          70

In [18]:
pd.merge(df_left,df_right,on=['key1','key2'],how='outer')

  key1 key2  left_data  right_data
0   SF  one         10          40
1   SF  one         10          50
2   SF  one         10          60
3   SF  two         20         NaN
4   LA  one         30         NaN
5   LA  two        NaN          70

In [19]:
# pandas adds suffix if you merge and there are matching columns
pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    one          50
2   SF    one         10    one          60
3   SF    two         20    one          40
4   SF    two         20    one          50
5   SF    two         20    one          60
6   LA    one         30    two          70

In [22]:
# edit the suffix names
pd.merge(df_left,df_right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  left_data key2_right  right_data
0   SF       one         10        one          40
1   SF       one         10        one          50
2   SF       one         10        one          60
3   SF       two         20        one          40
4   SF       two         20        one          50
5   SF       two         20        one          60
6   LA       one         30        two          70

In [ ]:
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html